Revit 2024 API
RevitCommandId.Id Property
 The command id.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public uint Id { get; }
Visual Basic
Public ReadOnly Property Id As UInteger
	Get
Visual C++
public:
property unsigned int Id {
	unsigned int get ();
}
See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace